In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame(columns=['Name', 'Age', 'Height'])
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [5]:
df.loc[0] = ['Allen', '22', '175']
df.loc[1] = ['Ted', '25', '180']
df.loc[2] = ['Jack', '28', '170']

In [6]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    170

In [7]:
df['Weight'] = ['75', '80', '70']

In [8]:
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80
2   Jack  28    170     70

In [9]:
df.drop(['Weight'], axis=1)

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    170

In [10]:
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80
2   Jack  28    170     70

In [11]:
df = df.drop(['Weight'], axis=1)

In [12]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    170

In [13]:
df.drop(2)

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [14]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    170

In [15]:
df = df.drop(2)

In [16]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [17]:
df['Age'][0]

'22'

In [18]:
df['Age'][0] = '23'

In [19]:
df

    Name Age Height
0  Allen  23    175
1    Ted  25    180

In [20]:
df['Age'] = '123'

In [21]:
df

    Name  Age Height
0  Allen  123    175
1    Ted  123    180

In [22]:
df.loc[0]

Name      Allen
Age         123
Height      175
Name: 0, dtype: object

In [23]:
df.loc[0] = 'aaaa'

In [24]:
df

   Name   Age Height
0  aaaa  aaaa   aaaa
1   Ted   123    180

In [25]:
df.to_csv('./test.csv')

In [26]:
df.to_csv('./test.csv', index=0)

In [27]:
df2 = pd.read_csv('./test.csv')

In [28]:
df2

   Name   Age Height
0  aaaa  aaaa   aaaa
1   Ted   123    180

In [29]:
columns = ['Name', 'Age', 'Height']
data = [
    ['Allen', '22', '175'],
    ['Ted', '25', '180']
]

df3 = pd.DataFrame(data=data, columns=columns)
df3

    Name Age Height
0  Allen  22    175
1    Ted  25    180